In [1]:
import os
import psycopg2 as ps
import pandas as pd

#install ipython-sql: !pip installl ipython-sql
#Load SQL module
%load_ext sql
#Load sql module
%sql sqlite://

#### create table

In [2]:
%%sql
CREATE TABLE books
(
    id INTEGER PRIMARY KEY, 
    name TEXT, 
    rating float
);

 * sqlite://
Done.

[]

#### Insert items to table

In [3]:
%%sql 
INSERT INTO books VALUES(1, "Fluid", 4.5);
INSERT INTO books VALUES(2, "Visionary Thinking", 4);
INSERT INTO books VALUES(3, "Atomic Habits", 4.6);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Qurying

In [4]:
%%sql
SELECT * from books

 * sqlite://
Done.

[(1, 'Fluid', 4.5), (2, 'Visionary Thinking', 4.0), (3, 'Atomic Habits', 4.6)]

In [5]:
result = _

In [6]:
df = result.DataFrame()

In [7]:
df

   id                name  rating
0   1               Fluid     4.5
1   2  Visionary Thinking     4.0
2   3       Atomic Habits     4.6

In [8]:
%%sql
SELECT name FROM books

 * sqlite://
Done.

[('Fluid',), ('Visionary Thinking',), ('Atomic Habits',)]

In [9]:
%%sql
SELECT * FROM books ORDER BY rating DESC

 * sqlite://
Done.

[(3, 'Atomic Habits', 4.6), (1, 'Fluid', 4.5), (2, 'Visionary Thinking', 4.0)]

In [10]:
%%sql
CREATE TABLE movies (id INTEGER PRIMARY KEY, name TEXT, release_year INTEGER);
INSERT INTO movies VALUES (1, "Avatar", 2009);
INSERT INTO movies VALUES (2, "Titanic", 1997);
INSERT INTO movies VALUES (3, "Star Wars: Episode IV - A New Hope", 1977);
INSERT INTO movies VALUES (4, "Shrek 2", 2004);
INSERT INTO movies VALUES (5, "The Lion King", 1994);
INSERT INTO movies VALUES (6, "Disney's Up", 2009);

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql
SELECT * FROM movies

 * sqlite://
Done.

[(1, 'Avatar', 2009),
 (2, 'Titanic', 1997),
 (3, 'Star Wars: Episode IV - A New Hope', 1977),
 (4, 'Shrek 2', 2004),
 (5, 'The Lion King', 1994),
 (6, "Disney's Up", 2009)]

#### retrieves only the movies that were released in the year 2000 or later, not before. Sort the results so that the earlier movies are listed first.

In [12]:
%%sql
SELECT * FROM movies WHERE release_year>=2000 ORDER BY release_year

 * sqlite://
Done.

[(4, 'Shrek 2', 2004), (1, 'Avatar', 2009), (6, "Disney's Up", 2009)]

#### Aggregating Data

In [13]:
%%sql
CREATE TABLE todo_list (id INTEGER PRIMARY KEY, item TEXT, minutes INTEGER);
INSERT INTO todo_list VALUES (1, "Wash the dishes", 15);
INSERT INTO todo_list VALUES (2, "vacuuming", 20);
INSERT INTO todo_list VALUES (3, "Learn some stuff on KA", 30);
INSERT INTO todo_list VALUES (4, "Workout", 40);


SELECT SUM(minutes) FROM todo_list

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(105,)]

##### Use of AND OR

In [14]:
%%sql
CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER);

INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ('biking', 30, 100, 110);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ('dancing', 15, 200, 120);

 * sqlite://
Done.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql
SELECT * FROM exercise_logs WHERE calories>100;

 * sqlite://
Done.

[(2, 'dancing', 15, 200, 120)]

In [16]:
%%sql
SELECT * FROM exercise_logs WHERE calories>100 OR minutes>15;

 * sqlite://
Done.

[(1, 'biking', 30, 100, 110), (2, 'dancing', 15, 200, 120)]

#### ANother Example

In [17]:
%%sql
CREATE TABLE songs (
    id INTEGER PRIMARY KEY,
    title TEXT,
    artist TEXT,
    mood TEXT,
    duration INTEGER,
    released INTEGER);
    
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("Bohemian Rhapsody", "Queen", "epic", 60, 1975);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("Let it go", "Idina Menzel", "epic", 227, 2013);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("I will survive", "Gloria Gaynor", "epic", 198, 1978);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("Twist and Shout", "The Beatles", "happy", 152, 1963);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("La Bamba", "Ritchie Valens", "happy", 166, 1958);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("I will always love you", "Whitney Houston", "epic", 273, 1992);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("Sweet Caroline", "Neil Diamond", "happy", 201, 1969);
INSERT INTO songs (title, artist, mood, duration, released)
    VALUES ("Call me maybe", "Carly Rae Jepsen", "happy", 193, 2011);
    
    
SELECT title FROM songs;

SELECT title FROM songs WHERE released > 1990 OR mood=='epic';

SELECT title FROM songs WHERE released > 1990 AND mood=='epic' AND duration < 4*60;

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
Done.
Done.

[('Let it go',)]

##### Usage of IN

In [18]:
%%sql
CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER, 
    calories INTEGER,
    heart_rate INTEGER);

INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 30, 100, 110);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("biking", 10, 30, 105);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("dancing", 15, 200, 120);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("tree climbing", 25, 72, 80);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("rowing", 30, 70, 90);
INSERT INTO exercise_logs(type, minutes, calories, heart_rate) VALUES ("hiking", 60, 80, 85);

SELECT * FROM exercise_logs WHERE type = "biking" OR type = "hiking" OR type = "tree climbing" OR type = "rowing";

/* IN */
SELECT * FROM exercise_logs WHERE type IN ("biking", "hiking", "tree climbing", "rowing");

 * sqlite://
(sqlite3.OperationalError) table exercise_logs already exists
[SQL: CREATE TABLE exercise_logs
    (id INTEGER PRIMARY KEY AUTOINCREMENT,
    type TEXT,
    minutes INTEGER,
    calories INTEGER,
    heart_rate INTEGER);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [19]:
%%sql
CREATE TABLE drs_favorites
    (id INTEGER PRIMARY KEY,
    type TEXT,
    reason TEXT);

INSERT INTO drs_favorites(type, reason) VALUES ("biking", "Improves endurance and flexibility.");
INSERT INTO drs_favorites(type, reason) VALUES ("hiking", "Increases cardiovascular health.");

 * sqlite://
Done.
1 rows affected.
1 rows affected.

[]

#### Sub Query

In [20]:
%%sql
SELECT * FROM exercise_logs WHERE type IN (SELECT type FROM drs_favorites);

 * sqlite://
Done.

[(1, 'biking', 30, 100, 110)]

In [21]:
%%sql

SELECT * FROM exercise_logs WHERE type IN (
    SELECT type FROM drs_favorites WHERE reason LIKE "%cardiovascular%");

 * sqlite://
Done.

[]

##### Sub querying another example

In [22]:
%%sql
CREATE TABLE artists (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    country TEXT,
    genre TEXT);

INSERT INTO artists (name, country, genre)
    VALUES ("Taylor Swift", "US", "Pop");
INSERT INTO artists (name, country, genre)
    VALUES ("Led Zeppelin", "US", "Hard rock");
INSERT INTO artists (name, country, genre)
    VALUES ("ABBA", "Sweden", "Disco");
INSERT INTO artists (name, country, genre)
    VALUES ("Queen", "UK", "Rock");
INSERT INTO artists (name, country, genre)
    VALUES ("Celine Dion", "Canada", "Pop");
INSERT INTO artists (name, country, genre)
    VALUES ("Meatloaf", "US", "Hard rock");
INSERT INTO artists (name, country, genre)
    VALUES ("Garth Brooks", "US", "Country");
INSERT INTO artists (name, country, genre)
    VALUES ("Shania Twain", "Canada", "Country");
INSERT INTO artists (name, country, genre)
    VALUES ("Rihanna", "US", "Pop");
INSERT INTO artists (name, country, genre)
    VALUES ("Guns N' Roses", "US", "Hard rock");
INSERT INTO artists (name, country, genre)
    VALUES ("Gloria Estefan", "US", "Pop");
INSERT INTO artists (name, country, genre)
    VALUES ("Bob Marley", "Jamaica", "Reggae");

CREATE TABLE songs (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    artist TEXT,
    title TEXT);

INSERT INTO songs (artist, title)
    VALUES ("Taylor Swift", "Shake it off");
INSERT INTO songs (artist, title)
    VALUES ("Rihanna", "Stay");
INSERT INTO songs (artist, title)
    VALUES ("Celine Dion", "My heart will go on");
INSERT INTO songs (artist, title)
    VALUES ("Celine Dion", "A new day has come");
INSERT INTO songs (artist, title)
    VALUES ("Shania Twain", "Party for two");
INSERT INTO songs (artist, title)
    VALUES ("Gloria Estefan", "Conga");
INSERT INTO songs (artist, title)
    VALUES ("Led Zeppelin", "Stairway to heaven");
INSERT INTO songs (artist, title)
    VALUES ("ABBA", "Mamma mia");
INSERT INTO songs (artist, title)
    VALUES ("Queen", "Bicycle Race");
INSERT INTO songs (artist, title)
    VALUES ("Queen", "Bohemian Rhapsody");
INSERT INTO songs (artist, title)
    VALUES ("Guns N' Roses", "Don't cry");
    

SELECT title FROM songs WHERE artist IN(SELECT name FROM artists WHERE name == 'Queen');

SELECT name FROM artists WHERE genre=='Pop';

SELECT title FROM songs WHERE artist IN(SELECT name FROM artists WHERE genre=='Pop')

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(sqlite3.OperationalError) table songs already exists
[SQL: CREATE TABLE songs (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    artist TEXT,
    title TEXT);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)